{
    "logo": "Diego Ruiz Martin | Professional Portfolio",
    "home":"Home",
    "skills": "Skills",
    "education": "Education",
    "projects": "Projects",
    "subtitle-home": "Full Stack developer",
    "welcome": "Welcome to my professional portfolio",
    "hi": "Hi! My name is Diego, I am a fullstack developer and passionate about programmig. I invite you to get to know me a little more throguh my portfolio...",
    "aboutMe": "About me",
    "contact": "Contact me",
    "aboutMeText-1": "In 2019, while I was finishing my degree in Chemical Engineering, I began exploring the world of programming through tutorials in HTML, CSS, JavaScript, and Java.",
    "aboutMeText-2": "As time went on, I decided to strengthen my skills by taking courses and training at various educational centers and institutes, successfully completing courses in graphic design, UX/UI design, among others.",
    "aboutMeText-3": "In July 2024 I completed a master's degree in FullStack Development, through which I learned new tools for web application development.",
    "aboutMeText-4": "And the journey has only just begun, I aspire to achieve my dream of becoming a senior programmer. I am constantly seeking opportunities that allow me to grow both personally and professionally, with the ambition of creating innovative and captivating solutions that bring together the best of technical development and visual design.",
    "aboutMeText-5": "I am creative and innovative, dynamic, detail-oriented, a quick learner, and above all, I enjoy working in a team, contributing my part so that together, we can achieve any goals we set.",
    "engineer": "Chemical Engineer | 2019",
    "technician": "University Chemical Technician | 2018",
    "location": "Barcelona, Catalonia ",
    "nuclioDegree": "Full Stack Developer | 2024",
    "cacJava": "Java Full Stack Developer | 2021",
    "cacUxUi": "UX/UI Design | 2023",
    "cfpWeb": "Web pages design with Bootstrap 4 | 2021",
    "cfpGD": "Graphic Design | 2021",
    "specializations": "Specializations",
    "leadership": "Effective leadership for the 21st century | 2020",
    "google": "Google IT support | 2020",
    "management": "Management skills | 2020",
    "bsf": "Business strategic fundamentals | 2020",
    "courses": "Courses",
    "courseraB4": "Designing web pages with Bootstrap 4 | 2020",
    "html": "Introduction to HTML5",
    "bppm": "Basics of project planning and management | 2020",
    "fom": "Fundamentals of Management | 2020",
    "costs1": "Business Costs | 2020",
    "costs2": "International business I | 2020",
    "costs3": "International business II | 2020",
    "risks": "Risk management and projects changes administration | 2020",
    "analysis": "Introduction to cost analysis for business management | 2020",
    "projectsPlanning": "Project initiation and planning | 2020",
    "projectManagement": "Project management, the foundation of success | 2020",
    "formulation": "Formulation and evaluation of complex projects | 2020",
    "onlineCourses": "Online courses",
    "chokoladeDescription1": "This web development project was created for the pastry business Chokolade La Plata. Although the project was never published due to a client decision, the website is fully functional and designed to be completely responsive, adapting to different devices and screen sizes.",
    "chokoladeDescription2": "The development was carried out using HTML, CSS, and JavaScript, with Bootstrap as the framework.",
    "repository": "Repository",
    "lumaticDescription1": "This web development project was completed with three other people as part of the final master's project at Nuclio Digital School. It is inspired by the event application lu.ma.",
    "lumaticDescription2": "The developed platform offers a comprehensive system for event management, including authentication via email or mobile phone, using JsonWebToken and LocalStorage for secure session management. It features two types of user roles: administrator and event creator, each with specific permissions and functionalities. The platform includes forms for creating and editing events, subscriptions to events or cities, and real-time notifications using websockets, among other features. Image management is handled through Cloudinary.",
    "lumaticDescription3": "The platform was developed using technologies such as React, HTML, CSS, and JavaScript on the frontend, Node.js and Express on the backend, and MongoDB for the database.",
    "website": "Website",
    "simpleCalculator": "Simple Calculator",
    "simpleCalculatorDescription1": "This project involves the development of a simple calculator that performs basic operations, with features to prevent errors and options to change themes based on user preferences.",
    "simpleCalculatorDescription2": "The development was carried out using HTML, CSS, and JavaScript.",
    "simpleCalculatorDescription3": "The same calculator also was implemented using React JS.",
    "jsRepository": "JavaScript calculator repository",
    "reactRepository": "React calculator repository",
    "todoDescription1": "This project involves the development of a task management application with a design inspired by Windows 95. The interface features a bottom toolbar that detects the current time and displays it on screen, emulating the look of a desktop from that era. The application allows users to create, edit, and delete tasks, as well as indicate the status of each task as 'completed' or 'not completed' using representative images.",
    "todoDescription2": "The frontend was developed using React JS, while the backend was implemented with Express and Node.js.",
    "feRepository": "Frontend repository",
    "beRepository": "Backend repository",
    "downloadCV": "Download CV",
    "menu":"Menu",
    "accessCode": "Access code",
    "help": "Help",
    "send":"Send",
    "accessMenu": "Access menu",
    "startModal1": "This project involves the development of an interactive experience based on a spaceship, where access to different content sections is controlled by unique codes.",
    "startModal2-1": "For the ",
    "startModal2-2": "version, there is an access icon located in the top-right corner that allows navigation menus to be displayed. ",
    "startModal2-3": "Each menu is associated with a unique code visible in an interactive carousel (swipper). By entering that code into the control panel, you can unlock the corresponding section.",
    "startModal3": "Swipper with menus and their respective codes.",
    "startModal4": "Control panel to enter the section to unlock.",
    "startModal5": "version, the carousel is located on the left side, and the access control panel is on the right side, providing intuitive navigation between sections.",
    "startModal6": "Changing sections is simple: just enter a new code in the control panel and press the green button.",
    "close": "Close",
    "error": "Code error",
    "errorText":"Invalid code, please try again."
}