{
    "logo": "Diego Ruiz Martin | Portfoli Professional",
    "home": "Inici",
    "skills": "Habilitats Tecnològiques",
    "education": "Formació",
    "projects": "Projectes",
    "subtitle-home": "Desenvolupador Full Stack ",
    "welcome": "Benvinguts al meu portfoli professional",
    "hi": "Hola! Em dic Diego, sóc desenvolupador fullstack i un apassionat de la programació. T'invito que em coneguis una mica més a través del meu portfoli...",
    "aboutMe": "Sobre mi",
    "contact": "Contacta'm",
    "aboutMeText-1": "L'any 2019, mentre finalitzava la carrera d'Enginyeria Química, vaig començar a incursionar al món de la programació, mitjançant tutorials d'HTML, CSS, JavaScript i Java.",
    "aboutMeText-2": "Amb passar del temps, vaig decidir enfortir les meves habilitats realitzant cursos i capacitacions en diferents centres de formació i instituts, aconseguint finalitzar amb èxit cursos de disseny gràfic, disseny UX/UI, entre d'altres.",
    "aboutMeText-3": "El juliol de 2024 vaig finalitzar un màster a FullStack Development, mitjançant el qual vaig aprendre noves eines per al desenvolupament d'aplicacions web.",
    "aboutMeText-4": "I la carrera tot just comença, voldria poder aconseguir complir el meu somni de convertir-me en un programador sènior. Estic en constant recerca d'oportunitats que em permetin créixer tant a nivell personal com professional, amb l'ambició de crear solucions innovadores i captivadores que uneixin millor del desenvolupament tècnic i el disseny visual.",
    "aboutMeText-5": "Sóc creatiu i innovador, dinàmic, orientat al detall, aprenc ràpid i sobretot m'agrada treballar en equip, aportar el meu granet de sorra perquè així, entre tots, puguem assolir junts els objectius que s'imposin.",
    "engineer": "Enginyer Químic | 2019",
    "technician": "Tècnic Universitari en Química | 2018",
    "location": "Barcelona, Catalunya",
    "nuclioDegree": "Desenvolupador Full Stack | 2024",
    "cacJava": "Desenvolupador Full Stack Java | 2021",
    "cacUxUi": "Disseny UX/UI | 2023",
    "cfpWeb": "Disseny de pàgines web amb Bootstrap 4 | 2021",
    "cfpGD": "Disseny Gràfic | 2021",
    "specializations": "Especialitzacions",
    "leadership": "Lideratge efectiu per al segle XXI | 2020",
    "google": "Suport de tecnologies de la informació de google | 2020",
    "management": "Habilitats gerencials | 2020",
    "bsf": "Fonaments estratègics empresarials | 2020",
    "courses": "Cursos",
    "courseraB4": "Dissenyant pàgines web amb Bootstrap 4 | 2020",
    "html": "Introducció a HTML5 | 2020",
    "bppm": "Aspectes bàsics de la planificació i la gestió de projectes | 2020",
    "fom": "Aspectes fonamentals de la gerència | 2020",
    "costs1": "Costos per als negocis | 2020",
    "costs2": "Negocis Internacionals I | 2020",
    "costs3": "Negocis Internacionals II | 2020",
    "risks": "La gestió dels riscos i l'administració dels canvis en el projecte | 2020",
    "analysis": "Introducció a l'anàlisi de costos per a la direcció d'empreses | 2020",
    "projectsPlanning": "Iniciació i planificació de projectes | 2020",
    "projectManagement": "Gestió de projectes, la base de l'èxit | 2020",
    "formulation": "Formulació i avaluació de projectes complexos | 2020",
    "onlineCourses": "cursos en línia",
    "chokoladeDescription1": "Aquest projecte de desenvolupament web va ser creat per a l'emprenedoria de pastisseria Chokolade La Plata. Tot i que el projecte no va arribar a publicar-se a causa d'una decisió del client, el lloc és completament funcional i està dissenyat per ser totalment responsiu, adaptant-se a diferents dispositius i mides de pantalla.",
    "chokoladeDescription2": "El desenvolupament es va fer utilitzant HTML, CSS i JavaScript, amb Bootstrap com a framework.",
    "repository": "Repositori",
    "lumaticDescription1": "Aquest projecte de desenvolupament web va ser realitzat juntament amb 3 persones més, com a part del treball final del màster a Nuclio Digital School. Està inspirat en l'aplicació d'esdeveniments lu.ma.",
    "lumaticDescription2": "La plataforma desenvolupada ofereix un sistema complet per a la gestió d'esdeveniments, sistemes d'autenticació mitjançant correu electrònic o telèfon mòbil, utilitzant JsonWebToken i LocalStorage per a la gestió segura de sessions, amb dos tipus de rols d'usuari: administrador i creador d'esdeveniments, cada un amb permisos i funcionalitats especifiques. d'imatges es fa a través de Cloudinary.",
    "lumaticDescription3": "El desenvolupament de la plataforma es va dur a terme utilitzant tecnologies com React, HTML, CSS, JavaScript JS al frontend, Node.js i Express al backend, i MongoDB per a la base de dades.",
    "website": "Lloc web",
    "simpleCalculator": "Calculadora Simple",
    "simpleCalculatorDescription1": "Aquest projecte consisteix en el desenvolupament d'una calculadora simple que realitza operacions bàsiques, incloent-hi funcions per prevenir errors i opcions per canviar el tema segons la preferència de l'usuari.",
    "simpleCalculatorDescription2": "El desenvolupament es va fer utilitzant HTML, CSS i JavaScript.",
    "simpleCalculatorDescription3": "La mateixa calculadora va ser implementada utilitzant React JS.",
    "jsRepository": "Repositori calculadora JavaScript",
    "reactRepository": "Repositori calculadora React",
    "todoDescription1": "Aquest projecte consisteix en el desenvolupament d'una aplicació de tasques amb un disseny inspirat en Windows 95. La interfície presenta una barra d'eines inferior que detecta l'hora actual i la mostra en pantalla, emulant l'aparença d'un escriptori d'aquella època. L'aplicació permet als usuaris crear, editar i eliminar tasques, a més d'indicar l'estat de cadascuna com a 'realitzada' o 'no realitzada', utilitzant imatges representatives.",
    "todoDescription2": "El frontend està desenvolupat a React JS, mentre que el backend s'ha implementat amb Express i Node.js.",
    "feRepository": "Repositori frontend",
    "beRepository": "Repositori backend",
    "downloadCV": "Descarregar CV",
    "menu": "Menú",
    "accessCode": "Codi d'accés",
    "help": "Ajuda",
    "send": "Enviar",
    "accessMenu": "Menú d'acces",
   "startModal1": "Aquest projecte consisteix en el desenvolupament d'una experiència interactiva basada en una nau espacial, on l'accés a les diferents seccions de contingut està controlat per codis únics.",
    "startModal2-1": "Per a la versió ",
    "startModal2-2": "versió, hi ha una icona d'accés situada a la cantonada superior dreta que permet desplegar els menús de navegació. ",
    "startModal2-3": "Cada menú està associat a un codi únic visible en un carrusel interactiu (swipper). En introduir aquest codi al panell de control, podeu desbloquejar la secció corresponent.",
    "startModal3": "Swipper amb els menús i els seus codis respectius.",
    "startModal4": "Panell de control per introduir la secció a desbloquejar.",
    "startModal5": "el carrusel es troba al costat esquerre, i el panell de control d'accés, al costat dret, proporcionant una navegació intuïtiva entre seccions.",
    "startModal6": "Canviar de secció és senzill: només cal introduir un nou codi al panell de control i prémer el botó verd.",
    "close": "Tancar",
    "error": "Error de codi",
    "errorText":"Codi invàlid, si us plau intenteu neuvament."
}