{
    "logo": "Diego Ruiz Martin | Portfolio Profesional",
    "home": "Inicio",
    "skills": "Habilidades Tecnológicas",
    "education": "Formación",
    "projects": "Proyectos",
    "cv": "Curriculum Vitae",
    "cvTitle": "Curriculum Vitae Diego Ruiz Martín",
    "subtitle-home": "Desarrollador Full Stack",
    "welcome": "Bienvenidos a mi portfolio profesional",
    "hi": "¡Hola! Mi nombre es Diego, soy desarrollador fullstack y un apasionado de la programación. Te invito a que me conozcas un poco más a través de mi portfolio...",
    "aboutMe": "Sobre mí",
    "contact": "Contáctame",
    "aboutMeText-1": "Por el año 2019, mientras finalizaba la carrera de Ingeniería Química, comencé a incursionar en el mundo de la programación, mediante tutoriales de HTML, CSS, JavaScript y Java.",
    "aboutMeText-2": "Con el pasar del tiempo, decidí fortalecer mis habilidades realizando cursos y capacitaciones en distintos centros de formación e institutos, logrando finalizar exitosamente cursos de diseño gráfico, diseño UX/UI, entre otros.",
    "aboutMeText-3": "En julio de 2024 finalicé un master en FullStack Development, mediante el cual aprendí nuevas herramientas para el desarrollo de aplicaciones web.",
    "aboutMeText-4": "Y la carrera recién está empezando, quisiera poder lograr cumplir mi sueño de convertirme en un programador senior. Estoy en constante búsqueda de oportunidades que me permitan crecer tanto a nivel personal como profesional, con la ambición de crear soluciones innovadoras y cautivadoras que unan lo mejor del desarrollo técnico y el diseño visual.",
    "aboutMeText-5": "Soy creativo e innovador, dinámico, orientado al detalle, aprendo rápido y sobre todo me gusta trabajar en equipo, aportar mi granito de arena para que así, entre todos, podamos lograr juntos los objetivos que se impongan.",
    "engineer": "Ingeniero Químico | 2019",
    "technician": "Técnico Químico Universitario | 2018",
    "location": "Barcelona, Cataluña ",
    "nuclioDegree": "Desarrollador Full Stack | 2024",
    "cacJava": "Desarrollador Full Stack Java | 2021",
    "cacUxUi": "Diseño UX/UI | 2023",
    "cfpWeb": "Diseño de páginas web con Bootstrap 4 | 2021",
    "cfpGD": "Diseño Gráfico | 2021",
    "specializations": "Especializaciones",
    "leadership": "Liderazgo efectivo para el siglo XXI | 2020",
    "google": "Soporte de tecnologías de la información de google | 2020",
    "management": "Habilidades gerenciales | 2020",
    "bsf": "Fundamentos estratégicos empresariales | 2020",
    "courses": "Cursos",
    "courseraB4": "Diseñando páginas web con Bootstrap 4 | 2020",
    "html": "Introducción a HTML5 | 2020",
    "bppm": "Aspectos básicos de la planificación y la gestión de proyectos | 2020",
    "fom": "Aspectos fundamentales de la gerencia | 2020",
    "costs1": "Costos para los negocios | 2020",
    "costs2": "Negocios Internacionales I | 2020",
    "costs3": "Negocios Internacionales II | 2020",
    "risks": "La gestión de los riesgos y la administración de los cambios en el proyecto | 2020",
    "analysis": "Introducción al análisis de costos para la dirección de empresas | 2020",
    "projectsPlanning": "Iniciación y planificación de proyectos | 2020",
    "projectManagement": "Gestión de proyectos, la base del éxito | 2020",
    "formulation": "Formulación y evaluación de proyectos complejos | 2020",
    "onlineCourses": "Cursos en línea",
    "chokoladeDescription1": "Este proyecto de desarrollo web fue creado para el emprendimiento de pastelería Chokolade La Plata. A pesar de que el proyecto no llegó a publicarse debido a una decisión del cliente, el sitio es completamente funcional y está diseñado para ser totalmente responsivo, adaptándose a diferentes dispositivos y tamaños de pantalla.",
    "chokoladeDescription2": "El desarrollo se realizó utilizando HTML, CSS y JavaScript, con Bootstrap como framework.",
    "repository": "Repositorio",
    "lumaticDescription1": "Este proyecto de desarrollo web fue realizado junto con 3 personas más, como parte del trabajo final del máster en Nuclio Digital School. Está inspirado en la aplicación de eventos lu.ma.",
    "lumaticDescription2": "La plataforma desarrollada ofrece un sistema completo para la gestión de eventos, sistemas de autenticación mediante correo electrónico o teléfono móvil, utilizando JsonWebToken y LocalStorage para la gestión segura de sesiones, con dos tipos de roles de usuario: administrador y creador de eventos, cada uno con permisos y funcionalidades específicas. Posee formularios para la creación y edición de eventos, suscripciones a eventos o ciudades y notificaciones en tiempo real utilizando websockets, entre otras funcionalidades. La gestión de imágenes se realiza a través de Cloudinary.",
    "lumaticDescription3": "El desarrollo de la plataforma se llevó a cabo utilizando tecnologías como React, HTML, CSS, JavaScript JS en el frontend, Node.js y Express en el backend, y MongoDB para la base de datos.",
    "website": "Sitio web",
    "simpleCalculator": "Calculadora Simple",
    "simpleCalculatorDescription1": "Este proyecto consiste en el desarrollo de una calculadora simple que realiza operaciones básicas, incluyendo funciones para prevenir errores y opciones para cambiar el tema según la preferencia del usuario.",
    "simpleCalculatorDescription2": "El desarrollo se realizó utilizando HTML, CSS y JavaScript.",
    "simpleCalculatorDescription3": "La misma calculadora fue implementada utilizando React JS.",
    "jsRepository": "Repositorio calculadora JavaScript",
    "reactRepository": "Repositorio calculadora React",
    "todoDescription1": "Este proyecto consiste en el desarrollo de una aplicación de tareas con un diseño inspirado en Windows 95. La interfaz presenta una barra de herramientas inferior que detecta la hora actual y la muestra en pantalla, emulando la apariencia de un escritorio de esa época. La aplicación permite a los usuarios crear, editar y eliminar tareas, además de indicar el estado de cada una como 'realizada' o 'no realizada', utilizando imágenes representativas.",
    "todoDescription2": "El frontend está desarrollado en React JS, mientras que el backend se ha implementado con Express y Node.js.",
    "feRepository": "Repositorio frontend",
    "beRepository": "Repositorio backend",
    "downloadCV": "Descargar CV",
    "menu":"Menú",
    "accessCode": "Código de acceso",
    "help": "Ayuda",
    "send":"Enviar",    
    "accessMenu": "Menú de acceso",
    "startModal1": "Este proyecto consiste en el desarrollo de una experiencia interactiva basada en una nave espacial, en la cual el acceso a las diferentes secciones de contenido está controlado mediante códigos únicos.",
    "startModal2-1": "Para la versión ",
    "startModal2-2": "en la esquina superior derecha se encuentra un icono de acceso que permite desplegar los menús de navegación. ",
    "startModal2-3": "Cada menú está asociado a un código único visible en un carrusel interactivo (swipper). Al ingresar ese código en el panel de control podrán desbloquear la sección correspondiente.",
    "startModal3": "Swipper con los menus y sus respectivos códigos.",
    "startModal4": "Panel de control para ingresar la sección a desbloquear.",
    "startModal5": " el swipper se ubica en el lado izquierdo y el panel de control de acceso en el lado derecho, facilitando la navegación intuitiva entre secciones.",
    "startModal6": "Cambiar de sección es sencillo: basta con introducir un nuevo código en el panel de control y presionar el botón verde.",
    "close": "Cerrar",
    "error": "Error de código",
    "errorText":"Código inválido, por favor inténtalo nuevamente."
}